<?php

/**
 *
 * Паттерн проектирования Factory Method (Фабричный метод) на PHP
 * Фабричный метод (англ. Factory Method) — порождающий паттерн (шаблон) проектирования, предоставляющий подклассаминтерфейс для создания экземпляров некоторого класса. В момент создания наследники могут определить, какойкласс создавать. Иными словами, Фабрика делегирует создание объектов наследникам родительского класса. Этопозволяет использовать в коде программы не специфические классы, а манипулировать абстрактными объектами наболее высоком уровне. Также известен под названием виртуальный конструктор (англ. Virtual Constructor).
 *
 * Цель
 *
 * Определяет интерфейс для создания объекта, но оставляет подклассам решение о том, какой классинстанциировать. Фабричный метод позволяет классу делегировать создание подклассов. Используется, когда:
 *
 * классу заранее неизвестно, объекты каких подклассов ему нужно создавать.
 * класс спроектирован так, чтобы объекты, которые он создаёт, специфицировались подклассами.
 * класс делегирует свои обязанности одному из нескольких вспомогательных подклассов, и планируетсялокализовать знание о том, какой класс принимает эти обязанности на себя.
 * Плюсы
 *
 * позволяет сделать код создания объектов более универсальным, не привязываясь к конкретным классам(ConcreteProduct), а оперируя лишь общим интерфейсом (Product);
 * позволяет установить связь между параллельными иерархиями классов.
 * Минусы
 *
 * необходимость создавать наследника Creator для каждого нового типа продукта (ConcreteProduct).
 * Product — продукт
 * определяет интерфейс объектов, создаваемых абстрактным методом;
 * ProductA, ProductB — конкретный продукт
 * реализует интерфейс Product;
 * FactoryAbstract — создатель
 * объявляет фабричный метод, который возвращает объект типа Product. Может также содержатьреализацию этого метода «по умолчанию»;
 * может вызывать фабричный метод для создания объекта типа Product;
 * Factory — конкретный создатель
 * переопределяет фабричный метод таким образом, чтобы он создавал и возвращал объект классаConcreteProduct.
 *
 * php code example
 */

/**
 * Class Product
 */
abstract class Product
{

}

class ProductA extends Product
{

}

class ProductB extends Product
{

}

abstract class FactoryAbstract
{
    public function create($type)
    {
        switch ($type) {
            case'A':
                return new ProductA();
            case'B':
            default:
                return new ProductB();
        }
    }
}

class Factory extends FactoryAbstract
{
}

$factory = new Factory();
$productA = $factory->create('A');
